public/man/man1/mk_cmds.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - mk_cmds.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - mk_cmds.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>mk_cmds - error table compiler</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>mk_cmds</strong> file</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><strong>Mk_cmds</strong> converts a table listing command names and associated help
messages into a C source file suitable for use with the /ss/(3) library.</p>
<p>
The source file name must end with a suffix of ``.ct&#39;&#39;; the file
consists of a declaration supplying the name of the command table:</p>
<p>
<strong>command_table</strong> <em>name</em></p>
<p>
followed by entries of the form:</p>
<p>
[ <strong>request</strong> | <strong>unimplemented</strong> ] <em>name,</em> &#34; <em>string</em> &#34;[, abbrev]…;</p>
<p>
and a final</p>
<p>
<strong>end</strong></p>
<p>
to indicate the end of the table.</p>
<p>
A C source file is generated which should be compiled and linked with
the object files use the ss library.</p>
<p>
A ``#&#39;&#39; in the source file is treated as a comment character, and all
remaining text to the end of the source line will be ignored.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
BUGS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>Since the original <strong>mk_cmds</strong> uses a very simple parser based on
/yacc/(1), and this current version of <strong>mk_cmds</strong> uses an awk/sed
combination of scripts, its error recovery leaves much to be desired.</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
SEE ALSO
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>ss (3)</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
